/*Напишите объявление о продаже чего нибудь и выведите его на экран, в том виде как оно должно было бы быть напечатано*/

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	cout << "Продам: plastation 5 slim\nЦена\t\t\t 54.000р\nВстроеная память\t 1 ТБ\nТелефон \t\t +7 999 999 9999\n";
	return 0;
}